コンパイル結果

Reset (Shift (Pushmark; Num (1); Access (0); Apply; Num (2); Prim (+)))

i: Reset (Shift (Pushmark; Num (1); Access (0); Apply; Num (2); Prim (+)))
e: []
s: []
r: ●
t: ●
m: ●
------------------
i: Shift (Pushmark; Num (1); Access (0); Apply; Num (2); Prim (+))
e: []
s: []
r: ●
t: ●
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: Pushmark; Num (1); Access (0); Apply; Num (2); Prim (+)
e: ((⚫︎,[]),[],⚫︎,⚫︎)_S::[]
s: []
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: Num (1); Access (0); Apply; Num (2); Prim (+)
e: ((⚫︎,[]),[],⚫︎,⚫︎)_S::[]
s: ε::[]
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: Access (0); Apply; Num (2); Prim (+)
e: ((⚫︎,[]),[],⚫︎,⚫︎)_S::[]
s: 1::ε::[]
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: Apply; Num (2); Prim (+)
e: ((⚫︎,[]),[],⚫︎,⚫︎)_S::[]
s: ((⚫︎,[]),[],⚫︎,⚫︎)_S::1::ε::[]
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: ⚫︎
e: []
s: 1::[]　(ここ、ε消えてるけどいいの？→ と思ったら、いいらしい。メタ継続の最適化でどうにかしなければいけない部分かしら。)
r: ⚫︎
t: ⚫︎
m: ((Return; Num (2); Prim (+), []),(ε::[]),⚫︎,⚫︎).((●,[]),[],⚫︎,⚫︎).⚫︎
⭐️ 問題は、Apply 命令の VContS の規則が正しくないのが原因か。
- Return 命令を追加するときは (i, e) をセットにしないといけない
------------------
i: Return; Num (2); Prim (+)
e: []
s: ε::[]
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎
------------------
i: Return; Num (2); Prim (+)
e: []
s: 1::((⚫︎,[]),[],⚫︎,⚫︎)_S::1::ε::[]
r: ⚫︎
t: ⚫︎
m: ((●,[]),[],⚫︎,⚫︎).⚫︎


